app/controllers/sales_controller.rb

SELECT "sales".* FROM "sales"
---
  def index
    if (params[:cities]).nil?
      @sales = Sale.all

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "101"]]
---
  def show
    @sale = Sale.find(params[:id])

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "101"]]
---
  def edit
    @sale = Sale.find(params[:id])

INSERT INTO "sales" ("city", "created_at", "date", "good", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @sale = Sale.new(params[:sale])

    respond_to do |format|
      if @sale.save

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "101"]]
UPDATE "sales" SET "date" = '2015-01-01 00:00:00.000000', "updated_at" = '2015-01-11 18:37:49.433644' WHERE "sales"."id" = 101
---
  def update
    @sale = Sale.find(params[:id])

    respond_to do |format|
      if @sale.update_attributes(params[:sale])

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "101"]]
DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 101]]
---
  def destroy
    @sale = Sale.find(params[:id])
    @sale.destroy